scare66cro/Constellation/Nova_Firmware/lp_am2434/example.syscfg
/**
 * SysConfig for Constellation Nova on LP-AM2434 — Phase B (UART2 bridge + Ethernet)
 *
 * Combines:
 *   - Existing nova bridge UART2 @ 921600 (CONFIG_UART_BRIDGE)
 *   - SDK enet_lwip_cpsw reference: CPSW2G + 2× DP838xx PHYs + lwIP
 *
 * Memory layout follows the SDK enet ref (MSRAM 0x160000, FLASH 0x100000)
 * because lwIP+enet pools need ~700KB of RAM. Nova-only IPC/log/user-SHM
 * regions were dropped — they were boilerplate from the hello-world
 * template and never referenced by Nova firmware code.
 *
 * @cliArgs --device "AM2434" --package "FCCSP (ALX)" --variant "AM2434-E" --context "r5fss0-0" --product "MCU_PLUS_SDK_AM243x@12.00.00"
 */

/* ---- Modules ---- */
const eeprom          = scripting.addModule("/board/eeprom/eeprom", {}, false);
const eeprom1         = eeprom.addInstance();
const gpio            = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1           = gpio.addInstance();
const gpio2           = gpio.addInstance();
/* GDC orbit DO[0] — onboard USR LED on GPMC0_AD7. Mirrors door 1's
 * "open" contactor. Wired up by lp_orbit_io.c. Additional 9 DOs and
 * 10 DIs will be added here once BoosterPack pin assignments are
 * decided (see docs/LP-AM2434-Hardware-Bringup-Plan.md §11). */
const gpio3           = gpio.addInstance();
const i2c             = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1            = i2c.addInstance();
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const enet_cpsw       = scripting.addModule("/networking/enet_cpsw/enet_cpsw", {}, false);
const enet_cpsw1      = enet_cpsw.addInstance();

/* Nova bridge UART (UART2 @ 921600, polled in main.c) */
const uart            = scripting.addModule("/drivers/uart/uart", {}, false);
const uart1           = uart.addInstance();

/* OSPI NOR flash (W25Q64JV) — used by lp_device_config for per-board
 * provisioning (role/IP/netmask/gateway) survival across power cycles.
 * SBL already configures OSPI in DAC mode at 0x60000000 for XIP boot;
 * adding the Flash driver here gives us indirect-mode write/erase. */
const flash           = scripting.addModule("/board/flash/flash", {}, false);
const flash1          = flash.addInstance();

/* ---- EEPROM (board ID, MAC addresses) ---- */
eeprom1.$name = "CONFIG_EEPROM0";

/* ---- GPIOs for PHY reset + RGMII MUX select ---- */
gpio1.pinDir         = "OUTPUT";
gpio1.$name          = "CONFIG_ENET_RGMII_PHY_RST";
gpio1.pu_pd          = "pu";
gpio1.rx             = true;
gpio1.GPIO_n.$assign = "GPMC0_AD11";

gpio2.pinDir         = "OUTPUT";
gpio2.$name          = "CONFIG_ENET_RGMII_MUX_SEL";
gpio2.pu_pd          = "pu";
gpio2.rx             = true;
gpio2.GPIO_n.$assign = "GPMC0_AD12";

/* ---- GDC orbit DO[0] = onboard USR LED (GPMC0_AD7) ----
 * Visible smoke test: lights up while door 1's "open" contactor is
 * energized. The DO direction is set by SysConfig's generated
 * Drivers_open(); lp_orbit_io.c just calls GPIO_pinWriteHigh/Low. */
gpio3.pinDir         = "OUTPUT";
gpio3.$name          = "CONFIG_GDC_DO_0";
gpio3.pu_pd          = "pd";
gpio3.GPIO_n.$assign = "GPMC0_AD7";

/* ---- I2C0 (EEPROM peripheral) ---- */
i2c1.$name               = "CONFIG_I2C0";
eeprom1.peripheralDriver = i2c1;
i2c1.I2C.$assign         = "I2C0";
i2c1.I2C_child.$name     = "drivers_i2c_v0_i2c_v0_template1";

/* ---- UART0 console ---- */
debug_log.enableUartLog        = true;
debug_log.enableCssLog         = false;
debug_log.uartLog.$name        = "CONFIG_UART_CONSOLE";
debug_log.uartLog.UART.$assign = "USART0";

/* ---- UART2 bridge (Nova ↔ RPi5 COBS+protobuf @ 921600) ---- */
uart1.$name        = "CONFIG_UART_BRIDGE";
uart1.baudRate     = 921600;
uart1.operMode     = "13X";
uart1.UART.$assign = "USART2";

/* ---- OSPI NOR Flash (W25Q64JV @ 0x60000000) ----
 * Provides Flash_open / Flash_write / Flash_eraseBlk for
 * lp_device_config persistence. Reads stay memory-mapped (DAC mode);
 * only writes/erases switch to indirect mode through this driver. */
flash1.$name                         = "CONFIG_FLASH0";
flash1.bootQuirks                    = "Flash_quirkQSPIEarlyFixup";
flash1.peripheralDriver.$name        = "CONFIG_OSPI0";
flash1.peripheralDriver.inputClkFreq = 100000000;

/* ---- MPU regions ---- */
mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x41010000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

/* MSRAM: 8 MB region for code + lwIP/enet pools */
mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 23;

/* Non-cached enet DMA buffers */
mpu_armv75.$name             = "CONFIG_MPU_REGION5";
mpu_armv75.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv75.baseAddr          = 0xA5000000;
mpu_armv75.size              = 23;
mpu_armv75.attributes        = "NonCached";

